# За даден период от време, всеки ден в болницата пристигат пациенти за преглед.
# Тя разполага първоначално със 7 лекари. Всеки лекар може да преглежда само по един пациент на ден,
# но понякога има недостиг на лекари, затова останалите пациенти се изпращат в други болници.
# Всеки трети ден, болницата прави изчисления и ако броят на непрегледаните пациенти е по-голям от броя на прегледаните,
# се назначава още един лекар. Като назначаването става преди да започне приемът на пациенти за деня.
# Напишете програма, която изчислява за дадения период броя на прегледаните и непрегледаните пациенти.
# Вход
# Входът се чете от конзолата и съдържа:
# •	На първия ред – периода, за който трябва да направите изчисления. Цяло число в интервала [1 ... 1000]
# •	На следващите редове(равни на броят на дните) – броя пациенти, които пристигат за преглед за текущия ден.
# Цяло число в интервала [0…10 000]
# Изход
# Да се отпечатат на конзолата 2 реда :
# •	На първия ред: "Treated patients: {брой прегледани пациенти}."
# •	На втория ред: "Untreated patients: {брой непрегледани пациенти}."
period = int(input())

patients_examined = 0
patients_not_examined = 0
doctors = 7

for i in range(1, period + 1):
    patients_per_day = int(input())
    if patients_not_examined > patients_examined and i % 3 == 0 :
        doctors += 1
    if patients_per_day > doctors :
        patients_not_examined += patients_per_day - doctors
        patients_examined += doctors
    else:
        patients_examined += patients_per_day
print(f"Treated patients: {patients_examined}.")
print(f"Untreated patients: {patients_not_examined}.")