# Напишете програма, която да пресмята резултата от игра. Първо получавате число, което показва колко хода ще продължи играта.
# После за всеки ход на играта ще получавате по едно ново число.
# Според интервала в който попада числото се прибавят точки.
# Ако числото е отрицателно или по-голямо 50, тогава то е невалидно.
# В началото на играта резултата е 0 и на всеки ход се прибавят точки по следният начин:
# •	От 0 до 9  20 % от числото
# •	От 10 до 19  30 % от числото
# •	От 20 до 29  40 % от числото
# •	От 30 до 39  50 точки
# •	От 40 до 50  100 точки
# •	Невалидно число  резултата се дели на 2
# Освен резултата програмата трябва да изкарва статистика за проценти числа в дадените интервали.
# Входът се чете от конзолата:
# •	Първи ред - колко хода ще има по време на играта – цяло число в интервала [1...100]
# •	За всеки ход – числата, които се проверяват в кой интервал са – цели числа в интервала [-100...100]
# Изход
# Да се отпечата на конзолата 7 реда:
# •	1ви ред: "{Краен резултат}"
# •	2ри ред: "From 0 to 9: {процент в интервала}%"
# •	3ти ред: "From 10 to 19: {процент в интервала}%"
# •	4ти ред: "From 20 to 29: {процент в интервала}%"
# •	5ти ред: "From 30 to 39: {процент в интервала}%"
# •	6ти ред: "From 40 to 50: {процент в интервала}%"
# •	7ми ред: "Invalid numbers: {процент в интервала}%"
# Всички числа трябва да са форматирана до вторият знак след запетаята.

game_moves = int(input())

total_score = 0
_0_to_9 = 0
_10_to_19 = 0
_20_to_29 = 0
_30_to_39 = 0
_40_to_50 = 0
invalid = 0
for i in range(game_moves):
    score = int(input())
    if score < 0 or score > 50:
        total_score = total_score/ 2
        invalid += 1
    elif 0<= score <10:
        total_score += score*0.2
        _0_to_9 +=1
    elif 10 <= score < 20:
        total_score += score * 0.3
        _10_to_19 += 1
    elif 20 <= score < 30:
        total_score += score * 0.4
        _20_to_29 += 1
    elif 30 <= score < 40:
        total_score += + 50
        _30_to_39 += 1
    else:
        total_score += 100
        _40_to_50 += 1
print(f"{total_score:.2f}")
print(f"From 0 to 9: {_0_to_9/game_moves*100:.2f}%")
print(f"From 10 to 19: {_10_to_19/game_moves*100:.2f}%")
print(f"From 20 to 29: {_20_to_29/game_moves*100:.2f}%")
print(f"From 30 to 39: {_30_to_39/game_moves*100:.2f}%")
print(f"From 40 to 50: {_40_to_50/game_moves*100:.2f}%")
print(f"Invalid numbers: {invalid/game_moves*100:.2f}%")