# Дадено е цяло число – начален брой точки. Върху него се начисляват бонус точки по правилата, описани по-долу.
# Да се напише програма, която пресмята бонус точките, които получава числото и общия брой точки (числото + бонуса).
# · Ако числото е до 100 включително, бонус точките са 5;
# · Ако числото е по-голямо от 100, бонус точките са 20% от числото;
# · Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
# · Допълнителни бонус точки (начисляват се отделно от предходните):
# o За четно число à + 1 т.
# o За число, което завършва на 5 à + 2 т.

number = int(input())
if number < 100 :
    bonus = 5
elif number < 1000 :
    bonus = number * 0.2
else: bonus = number * 0.1
if number % 2 == 0 :
    bonus = bonus + 1
elif number % 10 == 5 :
    bonus = bonus + 2
print(bonus)
print(number + bonus)