# Напишете програма която проверява всички възможни комбинации от двойка числа в интервала от две дадени числа.
# На изхода се отпечатва, коя поред е комбинацията чиито сбор от числата е равен на дадено магическо число.
# Ако няма нито една комбинация отговаряща на условието се отпечатва съобщение, че не е намерено.
# Вход
# Входът се чете от конзолата и се състои от три реда:
# •	Първи ред – начало на интервала – цяло число в интервала [1...999]
# •	Втори ред – край на интервала – цяло число в интервала [по-голямо от първото число...1000]
# •	Трети ред – магическото число – цяло число в интервала [1...10000]
# Изход
# На конзолата трябва да се отпечата един ред, според резултата:
# •	Ако е намерена комбинация чиито сбор на числата е равен на магическото число
# o	"Combination N:{пореден номер} ({първото число} + {второ число} = {магическото число})"
# •	Ако не е намерена комбинация отговаряща на условието
# o	"{броят на всички комбинации} combinations - neither equals {магическото число}"
first_num = int(input())
second_num = int(input())
magic_num = int(input())
combination = 0
print_yes = 0
for x in range(first_num, second_num + 1):
     for y in range(first_num, second_num + 1):
        combination += 1
        if x + y == magic_num:
            print(f"Combination N:{combination} ({x} + {y} = {magic_num})")
            print_yes = 1
            break
     if print_yes == 1:
         break
if print_yes == 0:
    print(f"{combination} combinations - neither equals {magic_num}")