# Напишете програма, която извежда на конзолата номерата на стаите в една сграда (в низходящ ред),
# като са изпълнени следните условия:
# •	На всеки четен етаж има само офиси;
# •	На всеки нечетен етаж има само апартаменти;
# •	Всеки апартамент се означава по следния начин : А{номер на етажа}{номер на апартамента}, номерата на апартаментите започват от 0;
# •	Всеки офис се означава по следния начин : О{номер на етажа}{номер на офиса}, номерата на офисите също започват от 0;
# •	На последният етаж винаги има апартаменти и те са по-големи от останалите, затова пред номера им пише
# 'L', вместо 'А'. Ако има само един етаж, то има само големи апартаменти!
# От конзолата се прочитат две цели числа - броят на етажите и броят на стаите за един етаж.
floors = int(input())
apartments = int(input())
index = ''
output = ''
for f in range(floors,0,-1):
    output = ''
    for a in range(apartments):
        if f == floors:
            index = 'L'
        elif f % 2 == 0:
            index = 'O'
        else:
            index = "A"
        output += str(index) + str(f) + str(a) + str(' ')
    print(output)