# Студент трябва да пропътува n километра. Той има избор измежду три вида транспорт:
# •	Такси. Начална такса: 0.70 лв. Дневна тарифа: 0.79 лв. / км. Нощна тарифа: 0.90 лв. / км.
# •	Автобус. Дневна / нощна тарифа: 0.09 лв. / км. Може да се използва за разстояния минимум 20 км.
# •	Влак. Дневна / нощна тарифа: 0.06 лв. / км. Може да се използва за разстояния минимум 100 км.
# Напишете програма, която въвежда броя километри n и период от деня (ден или нощ) и изчислява цената на най-евтиния транспорт.
# Вход
# От конзолата се четат два реда:
# •	Първият ред съдържа числото n – брой километри – цяло число в интервала [1…5000]
# •	Вторият ред съдържа дума “day” или “night” – пътуване през деня или през нощта
# Изход
# Да се отпечата на конзолата най-ниската цена за посочения брой километри, форматирана до втория знак след десетичния разделител.

km_traveled = int(input())
day_part = input()
price_travel = 0
if km_traveled >= 100 :
    price_travel = km_traveled * 0.06
elif km_traveled >= 20 :
    price_travel = km_traveled * 0.09
elif day_part == "day":
    price_travel= km_traveled * 0.79 + 0.7
elif day_part == "night":
    price_travel = km_traveled * 0.90 + 0.7
print(f"{price_travel:.2f}")
