# Дадени са n цели числа в интервала [1…1000]. От тях някакъв процент p1 са под 200,
# друг процент p2 са от 200 до 399, друг процент p3 са от 400 до 599,
# друг процент p4 са от 600 до 799 и останалите p5 процента са от 800 нагоре.
# Да се напише програма, която изчислява и отпечатва процентите p1, p2, p3, p4 и p5.

n = int(input())

p1 = 0
p2 = 0
p3 = 0
p4 = 0
p5 = 0

for _ in range(n):
    number = int(input())
    if number < 200 :
        p1 += 1
    elif 200 <= number < 400 :
        p2 +=1
    elif 400 <= number < 600 :
        p3 +=1
    elif number >= 800 :
        p5 +=1
    else: p4 +=1
print(f"{p1/n*100:.2f}%")
print(f"{p2/n*100:.2f}%")
print(f"{p3/n*100:.2f}%")
print(f"{p4/n*100:.2f}%")
print(f"{p5/n*100:.2f}%")

