# Магазин за цветя предлага 3 вида цветя: хризантеми, рози и лалета. Цените зависят от сезона.
# Сезон	            Хризантеми	    Рози	        Лалета
# Пролет / Лято	    2.00 лв./бр.	4.10 лв./бр.	2.50 лв./бр.
# Есен / Зима	    3.75 лв./бр.	4.50 лв./бр.	4.15 лв./бр.
# В празнични дни цените на всички цветя се увеличават с 15%. Предлагат се следните отстъпки:
# •	За закупени повече от 7 лалета през пролетта – 5% от цената на целият букет.
# •	За закупени 10 или повече рози през зимата – 10% от цената на целият букет.
# •	За закупени повече от 20 цветя общо през всички сезони – 20% от цената на целият букет.
# Отстъпките се правят по така написания ред и могат да се наслагват! Всички отстъпки важат след оскъпяването за празничен ден!
# Цената за аранжиране на букета винаги е 2лв. Напишете програма, която изчислява цената за един букет.
# Вход
# Входът се чете от конзолата и съдържа точно 5 реда:
# •	На първия ред е броят на закупените хризантеми – цяло число в интервала [0 ... 200]
# •	На втория ред е броят на закупените рози – цяло число в интервала [0 ... 200]
# •	На третия ред е броят на закупените лалета – цяло число в интервала [0 ... 200]
# •	На четвъртия ред е посочен сезона – [Spring, Summer, Аutumn, Winter]
# •	На петия ред е посочено дали денят е празник – [Y – да / N - не]
# Изход
# Да се отпечата на конзолата 1 число – цената на цветята, форматирана до вторият знак след десетичната запетая.
chrysanthemums = int(input())
roses = int(input())
tulips = int(input())
season = input()
holyday = input()

if season == "Spring" or season == "Summer":
    chrysanthemum_price = 2.0
    rose_price = 4.1
    tulip_price = 2.5
else:
    chrysanthemum_price = 3.75
    rose_price = 4.5
    tulip_price = 4.15
if holyday =="Y":
    chrysanthemum_price = chrysanthemum_price * 1.15
    rose_price = rose_price * 1.15
    tulip_price = tulip_price * 1.15
total_amount = chrysanthemums * chrysanthemum_price + roses * rose_price + tulips * tulip_price
if tulips > 7 and season == "Spring" :
    total_amount = total_amount * 0.95
elif roses >= 10 and season == "Winter":
    total_amount = total_amount * 0.9
if chrysanthemums + roses + tulips > 20 :
    total_amount = total_amount * 0.8
total_amount = total_amount + 2
print(f"{total_amount:.2f}")