# Ресторант отваря врати и предлага няколко менюта на преференциални цени:
# • Пилешко меню – 10.35 лв.
# • Меню с риба – 12.40 лв.
# • Вегетарианско меню – 8.15 лв.
# Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
# Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
# Цената на доставка е 2.50 лв и се начислява най-накрая.
# Вход
# От конзолата се четат 3 реда:
# · Брой пилешки менюта – цяло число в интервала [0 … 99]
# · Брой менюта с риба – цяло число в интервала [0 … 99]
# · Брой вегетариански менюта – цяло число в интервала [0 … 99]
# Изход
# Да се отпечата на конзолата един ред: "{цена на поръчката}"
chicken_menu = int(input())
fish_menu = int(input())
vegi_menu = int(input())
total_food_price = chicken_menu * 10.35 + fish_menu * 12.4 + vegi_menu * 8.15
total_bill_price = total_food_price * 1.2 + 2.5
print(total_bill_price)